ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_syncbridgempu_regs.xml
<module id="SYNCBRIDGEMPU_REGS" HW_revision="" description="SYNCBRIDGEMPU Registers">
	<register id="MPUR1_START" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="MPU Region 1 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR1_END" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="MPU Region 1 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR1_LOCK" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="MPU 1 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR1_COMMIT" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="MPU 1 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR1_ACCESS" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="MPU Region 1 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR2_START" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="MPU Region 2 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR2_END" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="MPU Region 2 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR2_LOCK" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="MPU 2 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR2_COMMIT" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="MPU 2 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR2_ACCESS" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="MPU Region 2 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR3_START" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="MPU Region 3 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR3_END" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="MPU Region 3 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR3_LOCK" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="MPU 3 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR3_COMMIT" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="MPU 3 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR3_ACCESS" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="MPU Region 3 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR4_START" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="MPU Region 4 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR4_END" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="MPU Region 4 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR4_LOCK" width="32" page="0" offset="0x68" instances="1" instaddr="4" internal="0" description="MPU 4 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR4_COMMIT" width="32" page="0" offset="0x6c" instances="1" instaddr="4" internal="0" description="MPU 4 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR4_ACCESS" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="MPU Region 4 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR5_START" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="MPU Region 5 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
