ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_syncbridgempu_regs.xml
	<register id="MPUR5_END" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="MPU Region 5 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR5_LOCK" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="MPU 5 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR5_COMMIT" width="32" page="0" offset="0x8c" instances="1" instaddr="4" internal="0" description="MPU 5 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR5_ACCESS" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="MPU Region 5 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR6_START" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="MPU Region 6 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR6_END" width="32" page="0" offset="0xa4" instances="1" instaddr="4" internal="0" description="MPU Region 6 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR6_LOCK" width="32" page="0" offset="0xa8" instances="1" instaddr="4" internal="0" description="MPU 6 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR6_COMMIT" width="32" page="0" offset="0xac" instances="1" instaddr="4" internal="0" description="MPU 6 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR6_ACCESS" width="32" page="0" offset="0xb0" instances="1" instaddr="4" internal="0" description="MPU Region 6 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR7_START" width="32" page="0" offset="0xc0" instances="1" instaddr="4" internal="0" description="MPU Region 7 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR7_END" width="32" page="0" offset="0xc4" instances="1" instaddr="4" internal="0" description="MPU Region 7 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR7_LOCK" width="32" page="0" offset="0xc8" instances="1" instaddr="4" internal="0" description="MPU 7 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR7_COMMIT" width="32" page="0" offset="0xcc" instances="1" instaddr="4" internal="0" description="MPU 7 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR7_ACCESS" width="32" page="0" offset="0xd0" instances="1" instaddr="4" internal="0" description="MPU Region 7 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR8_START" width="32" page="0" offset="0xe0" instances="1" instaddr="4" internal="0" description="MPU Region 8 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR8_END" width="32" page="0" offset="0xe4" instances="1" instaddr="4" internal="0" description="MPU Region 8 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR8_LOCK" width="32" page="0" offset="0xe8" instances="1" instaddr="4" internal="0" description="MPU 8 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR8_COMMIT" width="32" page="0" offset="0xec" instances="1" instaddr="4" internal="0" description="MPU 8 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR8_ACCESS" width="32" page="0" offset="0xf0" instances="1" instaddr="4" internal="0" description="MPU Region 8 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR9_START" width="32" page="0" offset="0x100" instances="1" instaddr="4" internal="0" description="MPU Region 9 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR9_END" width="32" page="0" offset="0x104" instances="1" instaddr="4" internal="0" description="MPU Region 9 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
