ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_syncbridgempu_regs.xml
	<register id="MPUR9_LOCK" width="32" page="0" offset="0x108" instances="1" instaddr="4" internal="0" description="MPU 9 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR9_COMMIT" width="32" page="0" offset="0x10c" instances="1" instaddr="4" internal="0" description="MPU 9 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR9_ACCESS" width="32" page="0" offset="0x110" instances="1" instaddr="4" internal="0" description="MPU Region 9 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR10_START" width="32" page="0" offset="0x120" instances="1" instaddr="4" internal="0" description="MPU Region 10 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR10_END" width="32" page="0" offset="0x124" instances="1" instaddr="4" internal="0" description="MPU Region 10 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR10_LOCK" width="32" page="0" offset="0x128" instances="1" instaddr="4" internal="0" description="MPU 10 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR10_COMMIT" width="32" page="0" offset="0x12c" instances="1" instaddr="4" internal="0" description="MPU 10 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR10_ACCESS" width="32" page="0" offset="0x130" instances="1" instaddr="4" internal="0" description="MPU Region 10 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR11_START" width="32" page="0" offset="0x140" instances="1" instaddr="4" internal="0" description="MPU Region 11 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR11_END" width="32" page="0" offset="0x144" instances="1" instaddr="4" internal="0" description="MPU Region 11 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR11_LOCK" width="32" page="0" offset="0x148" instances="1" instaddr="4" internal="0" description="MPU 11 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR11_COMMIT" width="32" page="0" offset="0x14c" instances="1" instaddr="4" internal="0" description="MPU 11 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR11_ACCESS" width="32" page="0" offset="0x150" instances="1" instaddr="4" internal="0" description="MPU Region 11 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR12_START" width="32" page="0" offset="0x160" instances="1" instaddr="4" internal="0" description="MPU Region 12 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR12_END" width="32" page="0" offset="0x164" instances="1" instaddr="4" internal="0" description="MPU Region 12 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR12_LOCK" width="32" page="0" offset="0x168" instances="1" instaddr="4" internal="0" description="MPU 12 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR12_COMMIT" width="32" page="0" offset="0x16c" instances="1" instaddr="4" internal="0" description="MPU 12 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR12_ACCESS" width="32" page="0" offset="0x170" instances="1" instaddr="4" internal="0" description="MPU Region 12 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR13_START" width="32" page="0" offset="0x180" instances="1" instaddr="4" internal="0" description="MPU Region 13 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR13_END" width="32" page="0" offset="0x184" instances="1" instaddr="4" internal="0" description="MPU Region 13 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR13_LOCK" width="32" page="0" offset="0x188" instances="1" instaddr="4" internal="0" description="MPU 13 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR13_COMMIT" width="32" page="0" offset="0x18c" instances="1" instaddr="4" internal="0" description="MPU 13 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR13_ACCESS" width="32" page="0" offset="0x190" instances="1" instaddr="4" internal="0" description="MPU Region 13 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
