ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_syncbridgempu_regs.xml
	<register id="MPUR14_START" width="32" page="0" offset="0x1a0" instances="1" instaddr="4" internal="0" description="MPU Region 14 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR14_END" width="32" page="0" offset="0x1a4" instances="1" instaddr="4" internal="0" description="MPU Region 14 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR14_LOCK" width="32" page="0" offset="0x1a8" instances="1" instaddr="4" internal="0" description="MPU 14 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR14_COMMIT" width="32" page="0" offset="0x1ac" instances="1" instaddr="4" internal="0" description="MPU 14 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR14_ACCESS" width="32" page="0" offset="0x1b0" instances="1" instaddr="4" internal="0" description="MPU Region 14 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR15_START" width="32" page="0" offset="0x1c0" instances="1" instaddr="4" internal="0" description="MPU Region 15 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR15_END" width="32" page="0" offset="0x1c4" instances="1" instaddr="4" internal="0" description="MPU Region 15 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR15_LOCK" width="32" page="0" offset="0x1c8" instances="1" instaddr="4" internal="0" description="MPU 15 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR15_COMMIT" width="32" page="0" offset="0x1cc" instances="1" instaddr="4" internal="0" description="MPU 15 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR15_ACCESS" width="32" page="0" offset="0x1d0" instances="1" instaddr="4" internal="0" description="MPU Region 15 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUR16_START" width="32" page="0" offset="0x1e0" instances="1" instaddr="4" internal="0" description="MPU Region 16 Start Address">
		<bitfield id="ADDRL" description="Lower Start Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper Start Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR16_END" width="32" page="0" offset="0x1e4" instances="1" instaddr="4" internal="0" description="MPU Region 16 End Address">
		<bitfield id="ADDRL" description="Lower End Address" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="ADDRH" description="Upper End Address" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MPUR16_LOCK" width="32" page="0" offset="0x1e8" instances="1" instaddr="4" internal="0" description="MPU 16 Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR16_COMMIT" width="32" page="0" offset="0x1ec" instances="1" instaddr="4" internal="0" description="MPU 16 Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUR16_ACCESS" width="32" page="0" offset="0x1f0" instances="1" instaddr="4" internal="0" description="MPU Region 16 R/W Access Permissions">
		<bitfield id="ACCESS" description="Region Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="MPUCTRL" width="32" page="0" offset="0x7fc" instances="1" instaddr="4" internal="0" description="MPU Control Register">
		<bitfield id="MPUEN" description="Enable MPU function" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUCFG_LOCK" width="32" page="0" offset="0x81c" instances="1" instaddr="4" internal="0" description="Channel Configuration Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MPUCFG_COMMIT" width="32" page="0" offset="0x820" instances="1" instaddr="4" internal="0" description="Channel Configuration Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
